In [1]:
import pandas as pd

In [2]:
df =pd.DataFrame(columns=['Name', 'Age', 'Height'])

In [3]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [4]:
#用pandas才能在同一個list裡面放不同的資料型別
df.loc[0] = ['Joyce', 28, 168]    #會自己給index
df.loc[1] = ['SC', 42, 173]
df.loc[2] = ['PU', 63, 161]
df

    Name  Age  Height
0  Joyce   28     168
1     SC   42     173
2     PU   63     161

In [5]:
df["Age"]

0    28
1    42
2    63
Name: Age, dtype: int64

In [6]:
df["Weight"] = [58, 74, 49]
df

    Name  Age  Height  Weight
0  Joyce   28     168      58
1     SC   42     173      74
2     PU   63     161      49

In [7]:
df.drop(["Weight"], axis=1)    #drop預設是橫的刪除，要刪欄要加axis=1

    Name  Age  Height
0  Joyce   28     168
1     SC   42     173
2     PU   63     161

In [8]:
df    #刪掉是危險的狀態，所以不會直接真正刪掉

    Name  Age  Height  Weight
0  Joyce   28     168      58
1     SC   42     173      74
2     PU   63     161      49

In [9]:
df = df.drop(["Weight"], axis=1)     #刪掉是危險的狀態，所以要重新assign一次才會真正刪掉
df

    Name  Age  Height
0  Joyce   28     168
1     SC   42     173
2     PU   63     161

In [10]:
df = df.drop(2)    #刪掉列，index是2
df

    Name  Age  Height
0  Joyce   28     168
1     SC   42     173

In [12]:
df["Height"] = [180, 185]    #修改內容
df

    Name  Age  Height
0  Joyce   28     180
1     SC   42     185

In [27]:
df["Height"] = 165   #修改成全部一樣的內容
df

    Name  Age  Height
0  Joyce   28     165
1     SC   42     165

In [16]:
columns = ["Name", "Age", "Height"]
data = [
    ["JoJo", 28, 168],
    ["Thomas", 35 ,172],
    ["PUPU", 55, 158]
]

df2 = pd.DataFrame(
    data=data,
    columns=columns
)

df2

     Name  Age  Height
0    JoJo   28     168
1  Thomas   35     172
2    PUPU   55     158

In [17]:
df_union = pd.concat(
    [df, df2]
)
df_union

     Name  Age  Height
0   Joyce   28     165
1      SC   42     165
0    JoJo   28     168
1  Thomas   35     172
2    PUPU   55     158

In [20]:
df_union = pd.concat(
    [df, df2]
).reset_index(drop=True)    #沒有給reset.index的drop參數了話，會把舊的index也留下來，再創一個新的index

df_union

     Name  Age  Height
0   Joyce   28     165
1      SC   42     165
2    JoJo   28     168
3  Thomas   35     172
4    PUPU   55     158

##### 匯出CSV

In [22]:
df_union.to_csv("basic.csv")

In [23]:
df_union.to_csv("basic_xindex.csv", index=False)    
#這樣就不會匯出不需要的index，如果連欄位名稱都不要，就再多一個參數header=None

##### 複製

In [29]:
df_backup = df.copy()
df["Height"] = 199
df

    Name  Age  Height
0  Joyce   28     199
1     SC   42     199

In [30]:
df_backup    #copy出來的檔案內容不會被改變，如果直接用變數相等，兩個檔案都會被改變

    Name  Age  Height
0  Joyce   28     165
1     SC   42     165